# Series

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
s = pd.Series([1,2,3]) #create series

In [5]:
s

0    1
1    2
2    3
dtype: int64

In [6]:
s = pd.Series([1,2,3], index=['a','b','c']) #create series with indexing

In [7]:
s

a    1
b    2
c    3
dtype: int64

In [8]:
t = pd.Series([4,5,6], index=['b','c','d']) #create another series with indexing

In [9]:
t

b    4
c    5
d    6
dtype: int64

In [10]:
s * t #multiplication

a     NaN
b     8.0
c    15.0
d     NaN
dtype: float64

In [11]:
type(s)

pandas.core.series.Series

# Dataframes

In [5]:
df = pd.DataFrame(data = [[2,4,6,-8],[3,5,7,9],[1,3,5,7]], columns = ['c1','c2','c3','c4'], index=['r1','r2','r3']) #create dataframe

In [6]:
df

    c1  c2  c3  c4
r1   2   4   6  -8
r2   3   5   7   9
r3   1   3   5   7

In [7]:
df.head() #displays head by default it takes upto 5

    c1  c2  c3  c4
r1   2   4   6  -8
r2   3   5   7   9
r3   1   3   5   7

In [8]:
df.head(1)

    c1  c2  c3  c4
r1   2   4   6  -8

In [9]:
df['c5'] = [2,4,7] #add new column

In [10]:
df

    c1  c2  c3  c4  c5
r1   2   4   6  -8   2
r2   3   5   7   9   4
r3   1   3   5   7   7

In [21]:
df['newC'] = df['c1']**2 #to get square of a column

In [22]:
df

    c1  c2  c3  c4  c5  newC
r1   2   4   6  -8   2     4
r2   3   5   7   9   4     9
r3   1   3   5   7   7     1

In [24]:
df.drop('c2', axis=1)

    c1  c3  c4  c5  newC
r1   2   6  -8   2     4
r2   3   7   9   4     9
r3   1   5   7   7     1

In [30]:
df

    c1  c3  c4  c5  newC
r1   2   6  -8   2     4
r2   3   7   9   4     9
r3   1   5   7   7     1

In [31]:
df.drop('c3', axis=1, inplace=True) #for modification in original dataframe

In [29]:
df

    c1  c3  c4  c5  newC
r1   2   6  -8   2     4
r2   3   7   9   4     9
r3   1   5   7   7     1

# Select

In [34]:
df

    c1  c4  c5  newC
r1   2  -8   2     4
r2   3   9   4     9
r3   1   7   7     1

In [35]:
df.loc['r2',:]

c1      3
c4      9
c5      4
newC    9
Name: r2, dtype: int64

In [36]:
df.loc['r2',['c1']]

c1    3
Name: r2, dtype: int64

In [39]:
df.iloc[1,:] #only difference is that it uses integer

c1      3
c4      9
c5      4
newC    9
Name: r2, dtype: int64

In [41]:
df.iloc[1,0]

3

In [43]:
df.reset_index()

  index  c1  c4  c5  newC
0    r1   2  -8   2     4
1    r2   3   9   4     9
2    r3   1   7   7     1

In [45]:
df

    c1  c4  c5  newC
r1   2  -8   2     4
r2   3   9   4     9
r3   1   7   7     1

In [48]:
df.set_index('c4', inplace=True)

In [49]:
df

    c1  c5  newC
c4
-8   2   2     4
 9   3   4     9
 7   1   7     1

In [50]:
df.loc[9,:]

c1      3
c5      4
newC    9
Name: 9, dtype: int64